app/views/shared/_header.html.erb

SELECT `pages`.* FROM `pages`
---
<% pages = Page.all %>