app/controllers/admin_controller.rb

SELECT  `pages`.* FROM `pages` LIMIT 2
SELECT COUNT(*) FROM `pages`
---
  def dashboard
    @pages = Page.all