app/controllers/pages_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`slug` = 'home' ORDER BY `pages`.`id` ASC LIMIT 1
---
  def show
    @page = Page.find_by_slug(params[:page])